
find way to get onu discription
x pon port
y onu id
====================================================
1.3.6.1.4.1.34592.1.3.4.1.1.5.1.x.y hardware version
====================================================
1.3.6.1.4.1.34592.1.3.4.1.1.6.1.x.y firmware version
====================================================
1.3.6.1.4.1.34592.1.3.4.1.1.7.1.x.y onu mac address
====================================================
1.3.6.1.4.1.34592.1.3.4.1.1.10.1.x.y returns integer 1 and 0 
1 == kown onu
0 == rogue onu
====================================================
1.3.6.1.4.1.34592.1.3.4.1.1.11.1.x.y returns integer 2 and 3 onu status
2 == onu offline
3 == onu online
====================================================
1.3.6.1.4.1.34592.1.3.4.1.1.13.1.x.y onu distance in meter
====================================================
1.3.6.1.4.1.34592.1.3.4.1.1.14.1.x.y returns integer 1 and 0 rougue onu detect
1 == kown onu
0 == rogue onu
====================================================
.34 retun hex string unable to decode or co-relate (work in progress)
====================================================
1.3.6.1.4.1.34592.1.3.4.1.1.36.1.x.y return rx power
vlaue from olt is unusable we need to convert using forumale below make sure you do not pass 0<===
(rx = (10*(log(rx power)/log(10)))-40 )
====================================================
1.3.6.1.4.1.34592.1.3.4.1.1.36.1.x.y retuns tx power 
vlaue from olt is unusable we need to convert using forumale below make sure you do not pass 0<===
(tx = (10*(log(tx power)/log(10)))-40 )
====================================================
1.3.6.1.4.1.34592.1.3.4.3.1.13.1.1.x.y onu port 
====================================================
1.3.6.1.4.1.34592.1.3.4.10.2.1.2.1.x.y.a.b customer mac address 
x pon port
y onu id
a onu port
b (1 to 10 etc list each mac address on the onu of customer// if 2 customers are connected you will get 1 and 2 for b values and so on)
====================================================
Pon sfp rx and tx power
1.3.6.1.4.1.34592.1.3.3.4.5.1.5.1.x (where x=1-8) returns integer value/100 = dbm of rx power
1.3.6.1.4.1.34592.1.3.3.4.5.1.4.1.X (where x=1-8) returns integer value/100 = dbm of tx power
====================================================
